[
    {
        "title": "Запуск Constructor Script 1.0: что входит в релиз",
        "description": "Рассказываем о ключевых возможностях первой стабильной версии Constructor Script и о том, как платформа помогает командам запускать контент быстрее.",
        "excerpt": "Разбираем пять функций, которые делают Constructor Script надежной основой для редакционных проектов.",
        "featured_img": "/static/images/logo.png",
        "published": true,
        "tags": [
            "Constructor Script",
            "Обновление продукта",
            "Релиз"
        ],
        "author_username": "team",
        "sections": [
            {
                "title": "Зачем мы выпустили версию 1.0",
                "type": "standard",
                "elements": [
                    {
                        "type": "paragraph",
                        "content": {
                            "text": "После нескольких месяцев закрытого тестирования мы перевели Constructor Script в стабильный релиз. Основная цель — дать редакционным командам предсказуемый стек для публикации материалов, не жертвуя скоростью и удобством." 
                        }
                    },
                    {
                        "type": "paragraph",
                        "content": {
                            "text": "Нам важно, чтобы платформа одинаково хорошо работала как для технических авторов, так и для маркетинговых команд. Поэтому мы сосредоточились на стабильных API, редакторе секций и автоматизации типовых сценариев публикации." 
                        }
                    }
                ]
            },
            {
                "title": "Пять ключевых возможностей релиза",
                "type": "standard",
                "elements": [
                    {
                        "type": "list",
                        "content": {
                            "ordered": false,
                            "items": [
                                "Гибкий конструктор секций с готовыми блоками hero, списков и галерей",
                                "Кэширование на уровне сервисов для ускорения выдачи статей и лент",
                                "Автоматические карты Open Graph и структурированные данные для SEO",
                                "Расширяемое API для интеграции с формами обратной связи и аналитикой",
                                "Тематические шаблоны, которые можно адаптировать без правки кода"
                            ]
                        }
                    }
                ]
            },
            {
                "title": "Как начать работу",
                "type": "standard",
                "elements": [
                    {
                        "type": "paragraph",
                        "content": {
                            "text": "Чтобы развернуть Constructor Script, достаточно подключить базу данных и выбрать тему оформления. После первичной настройки администратор может создать команду и распределить права доступа." 
                        }
                    },
                    {
                        "type": "list",
                        "content": {
                            "ordered": true,
                            "items": [
                                "Пройдите мастер настройки и задайте базовые параметры сайта",
                                "Создайте категории и теги, чтобы структура контента была понятной",
                                "Используйте конструктор секций для сборки первой публикации"
                            ]
                        }
                    }
                ]
            },
            {
                "title": "Что дальше",
                "type": "standard",
                "elements": [
                    {
                        "type": "paragraph",
                        "content": {
                            "text": "Мы уже работаем над редактором с совместным доступом и модулем персональных рекомендаций. Делитесь обратной связью через форму в админке — она напрямую попадает в бэклог команды разработки." 
                        }
                    }
                ]
            }
        ]
    }
]
