{
    "title": "Privacy Policy",
    "slug": "privacy",
    "path": "/privacy",
    "description": "Privacy Policy for Constructor Script detailing the personal data we collect, how we use it, how it is shared, and the rights available to users.",
    "published": true,
    "template": "page",
    "sections": [
        {
            "title": "1. Overview",
            "elements": [
                {
                    "type": "paragraph",
                    "content": {
                        "text": "This Privacy Policy explains how Constructor Script collects, uses, and safeguards personal information when you access our Services. We are committed to handling data responsibly and transparently, and we encourage you to review this policy carefully to understand our practices."
                    }
                }
            ]
        },
        {
            "title": "2. Information We Collect",
            "elements": [
                {
                    "type": "paragraph",
                    "content": {
                        "text": "We collect information you provide directly, such as account registration details, profile information, support requests, and content you submit. We also collect technical data automatically, including IP addresses, device identifiers, browser types, and usage analytics generated through cookies or similar technologies."
                    }
                }
            ]
        },
        {
            "title": "3. How We Use Information",
            "elements": [
                {
                    "type": "paragraph",
                    "content": {
                        "text": "We use collected information to deliver and improve the Services, personalize your experience, provide customer support, process transactions, and monitor platform security. We may also use aggregated or anonymized data for analytics, product development, and marketing insights."
                    }
                }
            ]
        },
        {
            "title": "4. Sharing and Disclosure",
            "elements": [
                {
                    "type": "paragraph",
                    "content": {
                        "text": "We do not sell your personal information. We may share data with trusted service providers that assist us in operating the Services, subject to contractual obligations to safeguard your data. We may disclose information if required by law, to protect our rights or the rights of others, or in connection with a business transaction such as a merger or acquisition."
                    }
                }
            ]
        },
        {
            "title": "5. Data Retention and Security",
            "elements": [
                {
                    "type": "paragraph",
                    "content": {
                        "text": "We retain personal information for as long as necessary to fulfill the purposes outlined in this policy, comply with legal obligations, and resolve disputes. We implement administrative, technical, and physical safeguards designed to protect data against unauthorized access, loss, or misuse. However, no security measure is completely foolproof."
                    }
                }
            ]
        },
        {
            "title": "6. Your Rights and Choices",
            "elements": [
                {
                    "type": "paragraph",
                    "content": {
                        "text": "Depending on your location, you may have rights to access, correct, delete, or restrict the processing of your personal information. You can update your account details through the Services or contact us to exercise your rights. You may opt out of non-essential communications by following the unsubscribe instructions in our emails."
                    }
                }
            ]
        },
        {
            "title": "7. Contact Us",
            "elements": [
                {
                    "type": "paragraph",
                    "content": {
                        "text": "If you have questions about this Privacy Policy or our data practices, please contact us at privacy@constructor-script.com."
                    }
                }
            ]
        }
    ]
}
